[
  {"id":"HammerlyEtAl2019","abstract":"Memory access mechanisms such as cue-based retrieval have come to dominate theories of the processing of linguistic dependencies such as subject-verb agreement. One phenomenon that has been regarded as demonstrating the role of such mechanisms is the grammaticality asymmetry in agreement attraction, which is the observation that nouns other than the grammatical controller of agreement can influence the computation of subject-verb agreement in ungrammatical, but not grammatical, sentences. This asymmetry is most often accounted for via the dynamics of retrieval interference. We challenge this interpretation, arguing that the asymmetry largely reflects response bias. Three forced-choice judgment experiments show that neutralizing response bias results in a decrease in the size of the grammaticality asymmetry, or its elimination altogether. Together with the response time patterns in these experiments, this result favors an account that attributes attraction effects to a continuous and equivocal representation of number, rather than to the dynamics of retrieval interference. We implement a model of grammaticality judgments that links a continuous representation of number to the rate of evidence accumulation in a diffusion process. This model accounts for the presence or absence of the grammaticality asymmetry through shifts in the decisional starting point (i.e. response bias), and highlights the importance of monitoring for response bias effects in judgment tasks.","author":[{"family":"Hammerly","given":"Christopher"},{"family":"Staub","given":"Adrian"},{"family":"Dillon","given":"Brian"}],"container-title":"Cognitive Psychology","DOI":"10.1016/j.cogpsych.2019.01.001","ISSN":"00100285","issue":"January","issued":{"date-parts":[[2019]]},"page":"70–104","publisher":"Elsevier","title":"The grammaticality asymmetry in agreement attraction reflects response bias: Experimental and modeling evidence","type":"article-journal","URL":"https://doi.org/10.1016/j.cogpsych.2019.01.001","volume":"110"},
  {"id":"LagoEtAl2018","abstract":"We investigated the comprehension of subject-verb agreement in Turkish-German bilinguals using two tasks. The first task elicited speeded judgments to verb number violations in sentences that contained plural genitive modifiers. We addressed whether these modifiers elicited attraction errors, which have supported the use of a memory retrieval mechanism in monolingual comprehension studies. The second task examined the comprehension of a language-specific constraint of Turkish against plural-marked verbs with overt plural subjects. Bilinguals showed a reduced application of this constraint, as compared to Turkish monolinguals. Critically, both groups showed similar rates of attraction, but the bilingual group accepted ungrammatical sentences more often. We propose that the similarity in attraction rates supports the use of the same retrieval mechanism, but that bilinguals have more problems than monolinguals in the mapping of morphological to abstract agreement features during speeded comprehension, which results in increased acceptability of ungrammatical sentences.","author":[{"family":"Lago","given":"Sol"},{"family":"Felser","given":"Claudia"},{"family":"Gračanin-Yuksek","given":"Martina"},{"family":"Demir","given":"Orhan"},{"family":"Kırkıcı","given":"Bilal"},{"family":"Şafak","given":"Duygu Fatma"}],"container-title":"Linguistic Approaches to Bilingualism","DOI":"10.1075/lab.17019.lag","ISSN":"1879-9264","issue":"1","issued":{"date-parts":[[2018]]},"page":"1–29","title":"Straight from the horse's mouth: Agreement attraction effects with Turkish possessors","type":"article-journal","volume":"12"},
  {"id":"MacmillanCreelman2005","author":[{"family":"Macmillan","given":"Neil A."},{"family":"Creelman","given":"C. Douglas"}],"event-place":"Mahwah, NJ","issued":{"date-parts":[[2005]]},"publisher":"Erlbaum","publisher-place":"Mahwah, NJ","title":"Detection Theory (2nd edition)","type":"book"},
  {"id":"TurkLogacev2020","author":[{"family":"Türk","given":"Utku"},{"family":"Logačev","given":"Pavel"}],"event-place":"Amherst, MA","issued":{"date-parts":[[2020]]},"publisher-place":"Amherst, MA","title":"The role of shallow processing in agreement attraction","type":"manuscript","URL":"https://osf.io/x9pv7/"}
]
